In [1]:
# This is Homework 04c (Further Material)
# of the "Data Science" class at Technische Hochschule Rosenheim

In [2]:
# import numpy and pandas
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Further Material

This notebook covers a couple of subjects we will need for the class and which are not contained in the textbook. It will introduce a number of methods - use the documentation to learn about the method and it's parameters!

https://pandas.pydata.org/pandas-docs/stable/

### Reading and Writing Data in Text Format

Use the DataFrame method `read_csv` for the following exercise.

You are given a dataset of "census income data" in csv format, each row represents one person with the following attributes: age, workclass, fnlwgt, education, education-num, marital-status, occupation, relationship, race, sex, capital-gain, capital-loss, hours-per-week, native-country, income.

You can find this dataset in 'data/adult.data'.

- read the data into a DataFrame 'adult'. Make sure to name the columns properly.
- verify that adults contains 32561 tupels.

In [3]:
## Solutions

In [4]:
adult_path = 'data/adult.data'
adult = pd.read_csv(adult_path, names=['age', 'workclass', 'fnlwgt', 'education', 
                               'education-num', 'marital-status', 'occupation',
                               'relationship', 'race', 'sex', 'capital-gain',
                               'capital-loss', 'hours-per-week', 
                               'native-country', 'income'])
adult.count()

age               32561
workclass         32561
fnlwgt            32561
education         32561
education-num     32561
marital-status    32561
occupation        32561
relationship      32561
race              32561
sex               32561
capital-gain      32561
capital-loss      32561
hours-per-week    32561
native-country    32561
income            32561
dtype: int64

### JSON, XML and HTML

Use the DataFrame method `to_json` for the following exercise.

- write the 'adult' DataFrame to a JSON file 'adult.data.json' in the 'output' directory.
- verify the contents of the file using a web browser.

In [5]:
## Solutions

In [6]:
adult.to_json('output/adult.data.json')

### Binary Data Formats

Use the DataFrame method `ExcelFile` for the following exercise.

There is another file containing income data, in Excel format: 'data/adult.test.xls'.
- open this excel file as 'xls_file'
- use the property 'sheet_names' to figure out the name of the Sheets in this Excel file.
- use the 'parse' method to read the (only) Sheet into a DataFrame 'adult_test' and verify the result by looking at the first 5 rows.

In [7]:
## Solutions

In [8]:
xls_file = pd.ExcelFile('data/adult.test.xls')

In [9]:
xls_file.sheet_names

['AdultTest']

In [10]:
adult_test = xls_file.parse('AdultTest')
adult_test[0:5]

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.

### Reindexing

Use the DataFrame methods `reindex` and `drop` for the following exercise.

You are given the following revenue data:

In [11]:
df3 = DataFrame({'2010': {'Hans':1500, 'Egon':2500, 'Ute':3500, 
                'Susi':4000, 'Klaus':2200}, 
      '2011': {'Klaus': 6000, 'Uwe': 1500, 'Hans': 1000, 
               'Susi': 5000, 'Antonia':10000}})
df3.index.name = 'customer'
df3.columns.name='year'

- Use reindexing to add a row for the new customer 'Bernd' between Antonia and Egon, setting all his revenues to 0 (call this df4)
- Use reindexing to add a column for the year 2012 to df4 and call this df5
- Use the drop method twice in one line to remove the year 2010 as well as Egon and Susi from df5, call the new DataFrame df6
- use indexing and slicing to set the revenue of Bernd, Egon, Hans and Klaus to 0 for the year 2012 in df5
- set all remaining unknown revenues (NaN) to -1 using boolean indexing

In [12]:
## Solutions

In [13]:
df3.index

Index(['Hans', 'Egon', 'Ute', 'Susi', 'Klaus', 'Uwe', 'Antonia'], dtype='object', name='customer')

In [14]:
df4 = df3.reindex(index = ['Antonia', 'Bernd', 'Egon', 'Hans', 'Klaus', 
             'Susi', 'Ute', 'Uwe'], fill_value=0)
df4

year        2010     2011
customer
Antonia      NaN  10000.0
Bernd        0.0      0.0
Egon      2500.0      NaN
Hans      1500.0   1000.0
Klaus     2200.0   6000.0
Susi      4000.0   5000.0
Ute       3500.0      NaN
Uwe          NaN   1500.0

In [15]:
df5 = df4.reindex(columns=['2010', '2011', '2012'])
df5

year        2010     2011  2012
customer
Antonia      NaN  10000.0   NaN
Bernd        0.0      0.0   NaN
Egon      2500.0      NaN   NaN
Hans      1500.0   1000.0   NaN
Klaus     2200.0   6000.0   NaN
Susi      4000.0   5000.0   NaN
Ute       3500.0      NaN   NaN
Uwe          NaN   1500.0   NaN

In [16]:
df6 = df5.drop('2010', axis=1).drop(['Egon', 'Susi'])
df6

year         2011  2012
customer
Antonia   10000.0   NaN
Bernd         0.0   NaN
Hans       1000.0   NaN
Klaus      6000.0   NaN
Ute           NaN   NaN
Uwe        1500.0   NaN

In [17]:
df5['2012']['Bernd':'Klaus'] = 0
df5

year        2010     2011  2012
customer
Antonia      NaN  10000.0   NaN
Bernd        0.0      0.0   0.0
Egon      2500.0      NaN   0.0
Hans      1500.0   1000.0   0.0
Klaus     2200.0   6000.0   0.0
Susi      4000.0   5000.0   NaN
Ute       3500.0      NaN   NaN
Uwe          NaN   1500.0   NaN

In [18]:
df5[df5.isnull()] = -1
df5

year        2010     2011  2012
customer
Antonia     -1.0  10000.0  -1.0
Bernd        0.0      0.0   0.0
Egon      2500.0     -1.0   0.0
Hans      1500.0   1000.0   0.0
Klaus     2200.0   6000.0   0.0
Susi      4000.0   5000.0  -1.0
Ute       3500.0     -1.0  -1.0
Uwe         -1.0   1500.0  -1.0

### Sorting and Ranking

Use the DataFrame methods `sort_index`, `sort_values` and `rank` for the following exercise.

In [19]:
fra = DataFrame({'2010': {'Hans':1100, 'Klaus':200, 'Egon':300, 'Susi':400}, 
      '2012': {'Klaus': 1000, 'Jaques': 1100, 
               'Susanna': 5500, 'Julia':11100}})
fra.index.name = 'customer'
fra.columns.name='year'
fra.name = 'France'

- Sort the french customers by name
- Sort the french customers by revenue (descending) in 2012
- Now, rank the french customers by revenue (descending) in 2012, so that the customer with the highest revenue has rank 1, etc. Break ties by minimum rank, and show the result by ascending rank.
- Finally, select only the top-3 customers from the previous list.

In [20]:
## Solutions

In [21]:
fra.sort_index()

year        2010     2012
customer
Egon       300.0      NaN
Hans      1100.0      NaN
Jaques       NaN   1100.0
Julia        NaN  11100.0
Klaus      200.0   1000.0
Susanna      NaN   5500.0
Susi       400.0      NaN

In [22]:
fra['2012'].sort_values(ascending=False)

customer
Julia      11100.0
Susanna     5500.0
Jaques      1100.0
Klaus       1000.0
Hans           NaN
Egon           NaN
Susi           NaN
Name: 2012, dtype: float64

In [23]:
ranked = fra['2012'].rank(ascending=False, method='min').sort_values()
ranked

customer
Julia      1.0
Susanna    2.0
Jaques     3.0
Klaus      4.0
Hans       NaN
Egon       NaN
Susi       NaN
Name: 2012, dtype: float64

In [24]:
ranked[ranked<=3]

customer
Julia      1.0
Susanna    2.0
Jaques     3.0
Name: 2012, dtype: float64

### Unique Values and Value Counts

Use the DataFrame methods `unique` and `value_counts` for the following exercise.

You work behind the bar in a club and write down each cocktail you make in a list:

In [25]:
cocktails = Series(['Caipi', 'Mojito', 'Cuba Libre', 'Caipi', 'Caipi',
                   'Cuba Libre', 'Mojito', 'Caipi', 'Mojito'])

- Compute a list of all the different cocktails you made!
- How many cocktails of each kind did you make?

In [26]:
## Solutions

In [27]:
cocktails.unique()

array(['Caipi', 'Mojito', 'Cuba Libre'], dtype=object)

In [28]:
cocktails.value_counts()

Caipi         4
Mojito        3
Cuba Libre    2
dtype: int64

### Removing/Replacing

Use the DataFrame methods `drop_duplicates` and `replace` for the following exercise.

Consider the following DataFrame 'work2' from our ERP system:

In [29]:
work2 = DataFrame({'job': ['Projektleiter', 'Gruppenleiter', 'Sachbearbeiter', '', '', 'Projektleiter', 
                          'Gruppenleiter', '', 'Sachbearbeiter', 'Sachbearbeiter', 'Sachbearbeiter'],
                  'prj_number': ['p1', 'p3', 'p2', 'p2', 'p2', 'p3', 'p1', 'p1', 'p2', 'p3', 'p1'], 
                  'emp_number': ['10102', '10102', '25348', '18316', '29346', '2581', '9031', 
                                 '28559', '28559', '9031', '29346']})

- Each employee should have only one job in one project: remove all but the last row which violates this condition, and save the result in a new DataFrame 'work3'
- The job title 'Sachbearbeiter' has been changed to 'Spezialist'. Create a new DataFrame 'work4' based on 'work3' which reflects this change.

In [30]:
## Solutions

In [31]:
work3 = work2.drop_duplicates('emp_number', keep='last')
work3

               job prj_number emp_number
1    Gruppenleiter         p3      10102
2   Sachbearbeiter         p2      25348
3                          p2      18316
5    Projektleiter         p3       2581
8   Sachbearbeiter         p2      28559
9   Sachbearbeiter         p3       9031
10  Sachbearbeiter         p1      29346

In [32]:
work4 = work3.replace({'Sachbearbeiter':'Spezialist'})
work4

              job prj_number emp_number
1   Gruppenleiter         p3      10102
2      Spezialist         p2      25348
3                         p2      18316
5   Projektleiter         p3       2581
8      Spezialist         p2      28559
9      Spezialist         p3       9031
10     Spezialist         p1      29346

### Discretization and Binning

Use the DataFrame methods `cut` and `qcut` for the following exercise.

You have an array of income numbers:

In [33]:
incomes = [10274, 47628, 34876, 78028, 113765, 1836, 16537, 65184, 55127, 55271, 76201, 73529, 23438, 26142]

- discretize these into the incomes up to 10k, more than 10k to 50k, more than 50k to 100k and more than 100k. Print the bins together with the number of incomes in each bin.
- in addition, name your bins 'poor', 'average', 'rich' and 'filthyrich'. Again, print the bins together with the number of incomes in each bin.
- discretize these into the 4 quantiles called '25%', '50%', '75%' and '100%'. Again, print the bins together with the number of incomes in each bin.

Hint: the `max` method may be helpful as well!

In [34]:
## Solutions

In [35]:
bin_borders = [0, 10000, 50000, 100000, max(incomes)]
bins1 = pd.cut(incomes, bin_borders)
pd.value_counts(bins1)

(10000, 50000]      6
(50000, 100000]     6
(0, 10000]          1
(100000, 113765]    1
dtype: int64

In [36]:
bin_labels = ['poor', 'average', 'rich', 'filthyrich']
bins2 = pd.cut(incomes, bin_borders, labels=bin_labels)
pd.value_counts(bins2)

average       6
rich          6
poor          1
filthyrich    1
dtype: int64

In [37]:
bins3 = pd.qcut(incomes, 4, labels=['25%', '50%', '75%', '100%'])
pd.value_counts(bins3)

25%     4
100%    4
50%     3
75%     3
dtype: int64

### Outliers and Random Sampling

As will define as outliers all incomes of 9000 or less and of 99000 or more.
- convert 'incomes' to a DataFrame 'incomedf'
- compute all outliers in 'incomedf'
- change all outliers in 'incomedf' to the value -1. Verify that they are indeed -1.

Use the DataFrame method `take` for the following exercise. In addition, `np.random.permutation` and `np.random.randint` may be helpful.

- draw a random sample of 5 incomes from 'incomedf' without replacement
- draw a random sample of 20 incomes from 'incomedf' with replacement

Hint: Binary and Fancy indexing will be useful for all these exercises.

In [38]:
## Solutions

In [39]:
incomedf = DataFrame(incomes)
incomedf

         0
0    10274
1    47628
2    34876
3    78028
4   113765
5     1836
6    16537
7    65184
8    55127
9    55271
10   76201
11   73529
12   23438
13   26142

In [40]:
incomedf[((incomedf<=9000) | (incomedf>=99000)).any(1)]
# note: any(1) converts the boolean 
# DataFrame ((incomedf<=9000) | (incomedf>=99000)) into a boolean Series.
# Filtering the DataFrame incomedf with a DataFrame returns NaN for False values, 
# while filtering with a Series returns only the True rows, which is what we want

/tmp/ipykernel_84259/1920749356.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  incomedf[((incomedf<=9000) | (incomedf>=99000)).any(1)]

        0
4  113765
5    1836

In [41]:
incomedf[((incomedf<=9000) | (incomedf>=99000))] = -1
incomedf

        0
0   10274
1   47628
2   34876
3   78028
4      -1
5      -1
6   16537
7   65184
8   55127
9   55271
10  76201
11  73529
12  23438
13  26142

In [42]:
incomedf.take(np.random.permutation(len(incomedf))[:5])

        0
12  23438
6   16537
0   10274
13  26142
8   55127

In [43]:
sampler = np.random.randint(0, len(incomedf), size=20)
incomedf.take(sampler)

        0
7   65184
4      -1
12  23438
9   55271
5      -1
10  76201
2   34876
12  23438
3   78028
11  73529
8   55127
2   34876
7   65184
1   47628
5      -1
10  76201
2   34876
1   47628
13  26142
9   55271

---